aws/amazon-freertos/vendors/cypress/MTB/psoc6/psoc6csp/hal/COMPONENT_PSOC6HAL/include/cyhal_hw_types.h
/***************************************************************************//**
* \file cyhal_hw_types.h
*
* \brief
* Provides a struct definitions for configuration resources in the PDL.
*
********************************************************************************
* \copyright
* Copyright 2018-2020 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_hal_psoc6 PSoC 6 Implementation Specific
* \{
* This section provides details about the PSoC 6 implementation of the Cypress HAL.
* All information within this section is platform specific and is provided for reference.
* Portable application code should depend only on the APIs and types which are documented
* in the @ref group_hal section.
*
* \section group_hal_psoc6_mapping HAL Resource Hardware Mapping
* The following table shows a mapping of each HAL driver to the lower level firmware driver
* and the corresponding hardware resource. This is intended to help understand how the HAL
* is implemented for PSoC 6 and what features the underlying hardware supports.
*
* | HAL Resource     | PDL Driver(s)       | PSoC 6 Hardware                  |
* | ---------------- | ------------------- | -------------------------------- |
* | ADC              | cy_adc              | SAR ADC                          |
* | Clock            | cy_sysclk           | All clocks (system & peripheral) |
* | CRC              | cy_crypto_core_crc  | Crypto                           |
* | DAC              | cy_ctdac            | DAC                              |
* | DMA              | cy_dma, cy_dmac     | DMA Controller                   |
* | EZI2C            | cy_scb_ezi2c        | SCB                              |
* | Flash            | cy_flash            | Flash                            |
* | GPIO             | cy_gpio             | GPIO                             |
* | Hardware Manager | NA                  | NA                               |
* | I2C              | cy_scb_i2c          | SCB                              |
* | I2S              | cy_i2s              | I2S                              |
* | LPTimer          | cy_mcwdt            | MCWDT                            |
* | PDM/PCM          | cy_pdm_pcm          | PDM-PCM                          |
* | PWM              | cy_pwm              | TCPWM                            |
* | QSPI             | cy_smif             | QSPI (SMIF)                      |
* | RTC              | cy_rtc              | RTC                              |
* | SDHC             | cy_sd_host          | SD Host                          |
* | SDIO             | cy_sd_host, or NA   | SD Host, or UDB                  |
* | SPI              | cy_scb_spi          | SCB                              |
* | SysPM            | cy_syspm            | System Power Resources           |
* | System           | cy_syslib           | System Resources                 |
* | Timer            | cy_tcpwm_counter    | TCPWM                            |
* | TRNG             | cy_crypto_core_trng | Crypto                           |
* | UART             | cy_scb_uart         | SCB                              |
* | USB Device       | cy_usbfs_dev_drv    | USB-FS                           |
* | WDT              | cy_wdt              | WDT                              |
*
* \section group_hal_psoc6_errors Device Specific Errors
* Error codes generated by the low level level PDL driver all use module IDs starting
* with \ref CY_RSLT_MODULE_DRIVERS_PDL_BASE. The exact errors are documented for each
* driver in the
* <a href="https://cypresssemiconductorco.github.io/psoc6pdl/pdl_api_reference_manual/html/index.html">
* psoc6pdl documentation</a>.
*/

/**
* \addtogroup group_hal_psoc6_hw_types PSoC 6 Specific Hardware Types
* \{
* Aliases for types which are part of the public HAL interface but whose representations
* need to vary per HAL implementation
*/

#pragma once

#include "cy_pdl.h"
#include "cyhal_general_types.h"
#include "cyhal_hw_resources.h"
#include "cyhal_pin_package.h"
#include "cyhal_triggers.h"
#include <stdbool.h>

#if defined(CYHAL_UDB_SDIO)
    #include "SDIO_HOST.h"
#endif

#ifdef __cplusplus
extern "C" {
#endif


#ifndef CYHAL_ISR_PRIORITY_DEFAULT
/** Priority that is applied by default to all drivers when initalized. Priorities can be
 * overridden on each driver as part of enabling events.
 */
#define CYHAL_ISR_PRIORITY_DEFAULT  (7)
#endif

/**
* \cond INTERNAL
*/

#define CYHAL_CRC_IMPL_HEADER       "cyhal_crc_impl.h"      //!< Implementation specific header for CRC
#define CYHAL_DMA_IMPL_HEADER       "cyhal_dma_impl.h"      //!< Implementation specific header for DMA
#define CYHAL_CLOCK_IMPL_HEADER     "cyhal_clock_impl.h"    //!< Implementation specific header for Clocks
#define CYHAL_GPIO_IMPL_HEADER      "cyhal_gpio_impl.h"     //!< Implementation specific header for GPIO
#define CYHAL_PDMPCM_IMPL_HEADER    "cyhal_pdmpcm_impl.h"   //!< Implementation specific header for PDMPCM
#define CYHAL_PWM_IMPL_HEADER       "cyhal_pwm_impl.h"      //!< Implementation specific header for PWM
#define CYHAL_SYSTEM_IMPL_HEADER    "cyhal_system_impl.h"   //!< Implementation specific header for System
#define CYHAL_SYSPM_IMPL_HEADER     "cyhal_syspm_impl.h"    //!< Implementation specific header for System Power Management
#define CYHAL_TIMER_IMPL_HEADER     "cyhal_timer_impl.h"    //!< Implementation specific header for Timer
#define CYHAL_TRNG_IMPL_HEADER      "cyhal_trng_impl.h"     //!< Implementation specific header for TRNG

/** \endcond */

/**
*/
typedef uint32_t cyhal_source_t; //!< Routable signal source

